{
  "dict": {
    "home": {
      "initial_text": "Soy",
      "btn01": "Ver más",
      "btn02": "Descargar CV",
      "follow": "Seguime"
    },
    "about": {
      "title": "Soy Franco Galluccio",
      "subtitle": "Soy Desarrollador Web Full Stack",
      "description01": "Soy un profesional altamente motivado, con demostradas habilidades de proactividad, responsabilidad y trabajo en equipo. Me destaco por mi capacidad para adaptarme rápidamente a nuevos entornos y afrontar desafíos con creatividad y determinación. Mi compromiso con la excelencia me lleva a cumplir resultados de alta calidad y cumplimiento constante de los plazos.",
      "description02": "Además, tengo fuertes habilidades de comunicación y colaboración, lo que me permite trabajar de manera efectiva con colegas y clientes. Siempre estoy dispuesto a aprender y contribuir positivamente al éxito del equipo.",
      "list01": "Nombre",
      "list02": "Edad",
      "list03": "Teléfono",
      "list04": "Ubicación",
      "list05": "Web",
      "list06": "Email",
      "btn": "Descargar CV"
    },
    "titles": {
      "home": "Inicio",
      "about": "Sobre mi",
      "services": "Servicios",
      "resume": "Resumen",
      "portfolio": "Portfolio",
      "contact": "Contacto"
    },
    "services": {
      "title01": "Diseño creativo",
      "description01": "Soluciones en base a diseños creativos. Transformo ideas en experiencias visuales cautivadoras, combinando innovación y estética para captar toda la atención del ciente.",
      "title02": "Marca",
      "description02": "Llevo a tu marca a nuevos niveles, creando identidades distintivas que reflejan la esencia del negocio, ayudándote a destacar y conectar con tu audiencia de manera auténtica.",
      "title03": "Interfaz de usuario",
      "description03": "Mejoro la interacción con interfaces de usuario elegantes y funcionales, diseñando experiencias intuitivas que facilitan la navegación, asegurando fluidez y atractivo.",
      "title04": "Experiencia de usuario",
      "description04": "Priorizo al usuario en el centro de todo lo que hago. Mi servicio de experiencia del usuario se enfoca en crear recorridos suaves y envolventes, que hagan que los usuarios se sientan valorados y comprendidos.",
      "title05": "Código limpio",
      "description05": "La calidad y la claridad son la base de mi código. Ofreciendo un servicio de código limpio, puedes confiar en soluciones robustas, seguras y escalables que impulsarán tu proyecto a largo plazo.",
      "title06": "Soporte rápido",
      "description06": "El soporte rápido y eficiente está a solo un clic de distancia. Mi responsabilidad frente a posibles problemas técnicos asegura que siempre tengas el respaldo que necesitas para mantener el negocio en marcha."
    },
    "portfolio": {
      "categories": {
        "all": "Todos",
        "frontend": "Frontend",
        "full": "Full Stack",
        "mobile": "Aplicación Móvil"
      },
      "projects": {
        "description01": "Tienda online para cervecería, hecha con React, Context y Material UI. Adaptada a todas las pantallas, permite explorar y comprar cervezas artesanales fácilmente.",
        "description02": "Landing institucional en Next.js con diseño adaptativo basado en Figma. Usa SASS para estilos dinámicos y ofrece una experiencia visual atractiva y profesional.",
        "description03": "Landing en Next.js y Typescript con diseño basado en Figma. Usa SASS para estilos personalizados y presenta de forma clara los beneficios del servicio.",
        "description04": "E-commerce para hamburguesería con frontend y backend completos. Incluye gestión de usuarios, productos y roles con Express.js y MongoDB bajo arquitectura por capas.",
        "description05": "CRM para gestionar usuarios y códigos QR de mascotas. Al escanear el QR se accede a una landing con sus datos. Next.js en el frontend y Express.js en el backend.",
        "description06": "App móvil con React Native, Redux Toolkit y Firebase. Maneja autenticación, estado global, ubicación con Google Maps y carga de imágenes con Expo.",
        "description07": "Herramienta para gestionar datos críticos del negocio y procesos internos, con seguimiento de contenedores en mapa y registro de operaciones en tiempo real.",
        "description08": "Sistema tipo Helpdesk para mantenimiento. Permite crear y visualizar órdenes, y chatear en tiempo real entre usuarios y técnicos para una atención eficiente."
      }
    },
    "resume": {
      "title01": "Tecnicatura en Programación",
      "description01": "Formación práctica en desarrollo de software. Se abordan lenguajes, bases de datos, estructuras de datos y metodologías ágiles.",
      "title02": "Carrera de Desarrollo Full Stack",
      "description02": "Aprendizaje intensivo con la pila MERN (MongoDB, Express.js, React y Node.js), Git, Docker y despliegue en la nube. Trabajo en equipo y enfoque ágil.",
      "title03": "Bachiller en Ciencias Naturales",
      "description03": "Enfoque en biología, química y física, con una base sólida en el análisis de fenómenos naturales y el método científico."
    },
    "contact": {
      "resume": {
        "location": "Locacion",
        "email": "Email",
        "phone": "Telefono",
        "website": "Sitio web"
      },
      "form": {
        "name": "Nombre",
        "email": "Email",
        "subject": "Asunto",
        "subject_placeholder": "Oferta de trabajo",
        "message": "Mensaje",
        "message_placeholder": "Escribe tu mensaje ...",
        "btn": "Enviar mensaje",
        "loading": "Enviando"
      }
    },
    "toast": {
      "success": "Formulario enviado correctamente",
      "error_front": "Error al enviar el formulario",
      "error_back": "Error en el servidor"
    }
  }
}
